config.org
#+TITLE: Veryslow Emacs Config
#+AUTHOR: veryslowcode
#+STARTUP: showeverything

* Packages

** Package Archives

#+begin_src emacs-lisp
  (require 'package)

  ;; Enable package archives from both standard and melpa
  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
			   ("org" . "https://orgmode.org/elpa/")
			   ("elpa" . "https://elpa.gnu.org/packages/")))
  (package-initialize)
#+end_src

** Use Package

#+begin_src emacs-lisp
  ;; Install use-package if not already installed
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)  
#+end_src

* Gerneral

** User Interface

#+begin_src emacs-lisp
  ;; Turn off uneeded interface elements
  (tool-bar-mode 0)
  (scroll-bar-mode 0)
  (menu-bar-mode 0)

  ;; Disable unwanted interface behaviour
  (setq inhibit-startup-message t)
  (setq use-file-dialog nil)
  (setq use-dialog-box nil)
  (setq pop-up-windows nil)
#+end_src

** Backups

#+begin_src emacs-lisp
  ;; Clean up file backups for 1. visual aesthetics and 2. git
  (setq backup-directory-alist '((".*" . "~/.emacs.d/backup/")))
#+end_src

* Editor

#+begin_src emacs-lisp
  (global-display-line-numbers-mode 1) ;; Display line numbers
  (delete-selection-mode 1)            ;; Delete selected text by typing
#+end_src

** Font

#+begin_src emacs-lisp
  (set-face-attribute 'default nil
		      :font "FiraCode Nerd Font Mono"
		      :height 120
		      :weight 'medium)
#+end_src

** Themes

#+begin_src emacs-lisp
  (use-package doom-themes
      :init (load-theme 'doom-tomorrow-night t))
#+end_src

** Transparency

#+begin_src emacs-lisp
  ;; Ensure emacs version supports transparency
  ;; and if so, set transparency to 90%
  (unless (version< "29.0.0" emacs-version)
    (set-frame-parameter (selected-frame) 'alpha-background 90)
    (add-to-list 'default-frame-alist '(alpha-background . 90)))
#+end_src

* Dashboard

#+begin_src emacs-lisp
  (use-package dashboard
    :ensure t
    :config
    (dashboard-setup-startup-hook))

  (setq dashboard-banner-logo-title "Welcome to Emacs")
  (setq dashboard-startup-banner 'logo)
#+end_src

* Git

#+begin_src emacs-lisp
  (use-package magit)
#+end_src

* Languages

#+begin_src emacs-lisp
  (use-package rust-mode)
#+end_src

* Which Key

#+begin_src emacs-lisp
  (use-package which-key)
  (which-key-mode)
  (setq which-key-side-window-location 'bottom)
#+end_src
